bench-results/slimio_redis_fdp_disabled_always/0/summary_3.txt
====== SET ======
  28835840 requests completed in 897.45 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.343 milliseconds (cumulative count 1)
50.000% <= 1.255 milliseconds (cumulative count 14575889)
75.000% <= 1.511 milliseconds (cumulative count 21658181)
87.500% <= 1.815 milliseconds (cumulative count 25239008)
93.750% <= 2.079 milliseconds (cumulative count 27054604)
96.875% <= 2.263 milliseconds (cumulative count 27947863)
98.438% <= 2.399 milliseconds (cumulative count 28385353)
99.219% <= 2.519 milliseconds (cumulative count 28615916)
99.609% <= 2.647 milliseconds (cumulative count 28724233)
99.805% <= 2.823 milliseconds (cumulative count 28780239)
99.902% <= 3.031 milliseconds (cumulative count 28808097)
99.951% <= 3.391 milliseconds (cumulative count 28821862)
99.976% <= 6.823 milliseconds (cumulative count 28828817)
99.988% <= 8.135 milliseconds (cumulative count 28832328)
99.994% <= 393.215 milliseconds (cumulative count 28834080)
99.997% <= 1723.391 milliseconds (cumulative count 28834989)
99.998% <= 1795.071 milliseconds (cumulative count 28835405)
99.999% <= 1882.111 milliseconds (cumulative count 28835640)
100.000% <= 1945.599 milliseconds (cumulative count 28835740)
100.000% <= 2082.815 milliseconds (cumulative count 28835790)
100.000% <= 2398.207 milliseconds (cumulative count 28835821)
100.000% <= 2402.303 milliseconds (cumulative count 28835829)
100.000% <= 2404.351 milliseconds (cumulative count 28835840)
100.000% <= 2404.351 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 0.407 milliseconds (cumulative count 16)
0.001% <= 0.503 milliseconds (cumulative count 241)
0.009% <= 0.607 milliseconds (cumulative count 2528)
0.079% <= 0.703 milliseconds (cumulative count 22917)
4.522% <= 0.807 milliseconds (cumulative count 1303889)
8.032% <= 0.903 milliseconds (cumulative count 2316133)
17.888% <= 1.007 milliseconds (cumulative count 5158228)
29.055% <= 1.103 milliseconds (cumulative count 8378112)
43.834% <= 1.207 milliseconds (cumulative count 12639822)
56.816% <= 1.303 milliseconds (cumulative count 16383248)
66.776% <= 1.407 milliseconds (cumulative count 19255397)
74.507% <= 1.503 milliseconds (cumulative count 21484669)
80.335% <= 1.607 milliseconds (cumulative count 23165352)
84.005% <= 1.703 milliseconds (cumulative count 24223501)
87.300% <= 1.807 milliseconds (cumulative count 25173804)
89.824% <= 1.903 milliseconds (cumulative count 25901518)
92.305% <= 2.007 milliseconds (cumulative count 26616957)
94.287% <= 2.103 milliseconds (cumulative count 27188389)
99.922% <= 3.103 milliseconds (cumulative count 28813218)
99.958% <= 4.103 milliseconds (cumulative count 28823706)
99.960% <= 5.103 milliseconds (cumulative count 28824304)
99.962% <= 6.103 milliseconds (cumulative count 28824843)
99.980% <= 7.103 milliseconds (cumulative count 28829977)
99.988% <= 8.103 milliseconds (cumulative count 28832282)
99.990% <= 9.103 milliseconds (cumulative count 28832820)
99.990% <= 10.103 milliseconds (cumulative count 28832928)
99.990% <= 11.103 milliseconds (cumulative count 28833064)
99.991% <= 12.103 milliseconds (cumulative count 28833159)
99.991% <= 13.103 milliseconds (cumulative count 28833214)
99.991% <= 14.103 milliseconds (cumulative count 28833243)
99.991% <= 15.103 milliseconds (cumulative count 28833244)
99.991% <= 16.103 milliseconds (cumulative count 28833259)
99.991% <= 17.103 milliseconds (cumulative count 28833272)
99.991% <= 27.103 milliseconds (cumulative count 28833288)
99.991% <= 28.111 milliseconds (cumulative count 28833317)
99.991% <= 29.103 milliseconds (cumulative count 28833328)
99.991% <= 32.111 milliseconds (cumulative count 28833341)
99.991% <= 33.119 milliseconds (cumulative count 28833356)
99.991% <= 38.111 milliseconds (cumulative count 28833358)
99.991% <= 39.103 milliseconds (cumulative count 28833382)
99.991% <= 40.127 milliseconds (cumulative count 28833383)
99.992% <= 46.111 milliseconds (cumulative count 28833404)
99.992% <= 47.103 milliseconds (cumulative count 28833441)
99.992% <= 50.111 milliseconds (cumulative count 28833468)
99.992% <= 51.103 milliseconds (cumulative count 28833470)
99.992% <= 52.127 milliseconds (cumulative count 28833490)
99.992% <= 53.119 milliseconds (cumulative count 28833498)
99.992% <= 63.103 milliseconds (cumulative count 28833515)
99.992% <= 64.127 milliseconds (cumulative count 28833524)
99.992% <= 65.119 milliseconds (cumulative count 28833564)
99.992% <= 66.111 milliseconds (cumulative count 28833584)
99.992% <= 67.135 milliseconds (cumulative count 28833601)
99.992% <= 76.159 milliseconds (cumulative count 28833617)
99.992% <= 77.119 milliseconds (cumulative count 28833629)
99.992% <= 79.103 milliseconds (cumulative count 28833663)
99.993% <= 80.127 milliseconds (cumulative count 28833679)
99.993% <= 84.159 milliseconds (cumulative count 28833703)
99.993% <= 85.119 milliseconds (cumulative count 28833732)
99.993% <= 86.143 milliseconds (cumulative count 28833738)
99.993% <= 90.111 milliseconds (cumulative count 28833746)
99.993% <= 91.135 milliseconds (cumulative count 28833791)
99.993% <= 92.159 milliseconds (cumulative count 28833803)
99.993% <= 93.119 milliseconds (cumulative count 28833819)
99.993% <= 99.135 milliseconds (cumulative count 28833830)
99.993% <= 100.159 milliseconds (cumulative count 28833848)
99.993% <= 103.103 milliseconds (cumulative count 28833867)
99.993% <= 104.127 milliseconds (cumulative count 28833884)
99.993% <= 105.151 milliseconds (cumulative count 28833905)
99.993% <= 115.135 milliseconds (cumulative count 28833927)
99.993% <= 116.159 milliseconds (cumulative count 28833933)
99.993% <= 154.111 milliseconds (cumulative count 28833957)
99.994% <= 155.135 milliseconds (cumulative count 28833989)
99.994% <= 156.159 milliseconds (cumulative count 28833990)
99.994% <= 353.279 milliseconds (cumulative count 28834000)
99.994% <= 354.303 milliseconds (cumulative count 28834018)
99.994% <= 379.135 milliseconds (cumulative count 28834020)
99.994% <= 380.159 milliseconds (cumulative count 28834040)
99.994% <= 386.303 milliseconds (cumulative count 28834068)
99.994% <= 393.215 milliseconds (cumulative count 28834080)
99.994% <= 394.239 milliseconds (cumulative count 28834090)
99.994% <= 911.359 milliseconds (cumulative count 28834112)
99.994% <= 912.383 milliseconds (cumulative count 28834126)
99.994% <= 913.407 milliseconds (cumulative count 28834140)
99.994% <= 1443.839 milliseconds (cumulative count 28834141)
99.994% <= 1444.863 milliseconds (cumulative count 28834169)
99.994% <= 1550.335 milliseconds (cumulative count 28834200)
99.994% <= 1576.959 milliseconds (cumulative count 28834203)
99.994% <= 1577.983 milliseconds (cumulative count 28834218)
99.994% <= 1597.439 milliseconds (cumulative count 28834231)
99.994% <= 1598.463 milliseconds (cumulative count 28834239)
99.994% <= 1603.583 milliseconds (cumulative count 28834242)
99.995% <= 1604.607 milliseconds (cumulative count 28834268)
99.995% <= 1617.919 milliseconds (cumulative count 28834277)
99.995% <= 1618.943 milliseconds (cumulative count 28834296)
99.995% <= 1633.279 milliseconds (cumulative count 28834314)
99.995% <= 1634.303 milliseconds (cumulative count 28834315)
99.995% <= 1638.399 milliseconds (cumulative count 28834331)
99.995% <= 1639.423 milliseconds (cumulative count 28834347)
99.995% <= 1640.447 milliseconds (cumulative count 28834375)
99.995% <= 1645.567 milliseconds (cumulative count 28834387)
99.995% <= 1646.591 milliseconds (cumulative count 28834404)
99.995% <= 1649.663 milliseconds (cumulative count 28834444)
99.995% <= 1650.687 milliseconds (cumulative count 28834461)
99.995% <= 1654.783 milliseconds (cumulative count 28834463)
99.995% <= 1655.807 milliseconds (cumulative count 28834483)
99.995% <= 1661.951 milliseconds (cumulative count 28834511)
99.995% <= 1662.975 milliseconds (cumulative count 28834518)
99.996% <= 1663.999 milliseconds (cumulative count 28834568)
99.996% <= 1665.023 milliseconds (cumulative count 28834569)
99.996% <= 1667.071 milliseconds (cumulative count 28834583)
99.996% <= 1668.095 milliseconds (cumulative count 28834618)
99.996% <= 1675.263 milliseconds (cumulative count 28834624)
99.996% <= 1676.287 milliseconds (cumulative count 28834639)
99.996% <= 1677.311 milliseconds (cumulative count 28834667)
99.996% <= 1685.503 milliseconds (cumulative count 28834674)
99.996% <= 1686.527 milliseconds (cumulative count 28834696)
99.996% <= 1687.551 milliseconds (cumulative count 28834722)
99.996% <= 1688.575 milliseconds (cumulative count 28834723)
99.996% <= 1691.647 milliseconds (cumulative count 28834744)
99.996% <= 1700.863 milliseconds (cumulative count 28834756)
99.996% <= 1701.887 milliseconds (cumulative count 28834766)
99.996% <= 1705.983 milliseconds (cumulative count 28834769)
99.996% <= 1707.007 milliseconds (cumulative count 28834828)
99.997% <= 1708.031 milliseconds (cumulative count 28834845)
99.997% <= 1710.079 milliseconds (cumulative count 28834851)
99.997% <= 1711.103 milliseconds (cumulative count 28834898)
99.997% <= 1712.127 milliseconds (cumulative count 28834925)
99.997% <= 1713.151 milliseconds (cumulative count 28834926)
99.997% <= 1716.223 milliseconds (cumulative count 28834935)
99.997% <= 1717.247 milliseconds (cumulative count 28834950)
99.997% <= 1723.391 milliseconds (cumulative count 28834989)
99.997% <= 1724.415 milliseconds (cumulative count 28835008)
99.997% <= 1725.439 milliseconds (cumulative count 28835023)
99.997% <= 1728.511 milliseconds (cumulative count 28835050)
99.997% <= 1732.607 milliseconds (cumulative count 28835072)
99.997% <= 1733.631 milliseconds (cumulative count 28835100)
99.998% <= 1734.655 milliseconds (cumulative count 28835121)
99.998% <= 1736.703 milliseconds (cumulative count 28835147)
99.998% <= 1738.751 milliseconds (cumulative count 28835169)
99.998% <= 1739.775 milliseconds (cumulative count 28835197)
99.998% <= 1745.919 milliseconds (cumulative count 28835215)
99.998% <= 1746.943 milliseconds (cumulative count 28835219)
99.998% <= 1747.967 milliseconds (cumulative count 28835240)
99.998% <= 1752.063 milliseconds (cumulative count 28835256)
99.998% <= 1753.087 milliseconds (cumulative count 28835262)
99.998% <= 1763.327 milliseconds (cumulative count 28835290)
99.998% <= 1765.375 milliseconds (cumulative count 28835311)
99.998% <= 1771.519 milliseconds (cumulative count 28835318)
99.998% <= 1772.543 milliseconds (cumulative count 28835332)
99.998% <= 1774.591 milliseconds (cumulative count 28835347)
99.998% <= 1775.615 milliseconds (cumulative count 28835355)
99.998% <= 1787.903 milliseconds (cumulative count 28835362)
99.998% <= 1788.927 milliseconds (cumulative count 28835383)
99.998% <= 1794.047 milliseconds (cumulative count 28835398)
99.998% <= 1795.071 milliseconds (cumulative count 28835405)
99.999% <= 1814.527 milliseconds (cumulative count 28835426)
99.999% <= 1815.551 milliseconds (cumulative count 28835478)
99.999% <= 1818.623 milliseconds (cumulative count 28835486)
99.999% <= 1819.647 milliseconds (cumulative count 28835501)
99.999% <= 1820.671 milliseconds (cumulative count 28835504)
99.999% <= 1821.695 milliseconds (cumulative count 28835523)
99.999% <= 1822.719 milliseconds (cumulative count 28835541)
99.999% <= 1823.743 milliseconds (cumulative count 28835545)
99.999% <= 1825.791 milliseconds (cumulative count 28835563)
99.999% <= 1826.815 milliseconds (cumulative count 28835569)
99.999% <= 1860.607 milliseconds (cumulative count 28835590)
99.999% <= 1881.087 milliseconds (cumulative count 28835597)
99.999% <= 1882.111 milliseconds (cumulative count 28835640)
99.999% <= 1910.783 milliseconds (cumulative count 28835688)
99.999% <= 1911.807 milliseconds (cumulative count 28835690)
100.000% <= 1944.575 milliseconds (cumulative count 28835712)
100.000% <= 1945.599 milliseconds (cumulative count 28835740)
100.000% <= 2075.647 milliseconds (cumulative count 28835758)
100.000% <= 2076.671 milliseconds (cumulative count 28835767)
100.000% <= 2081.791 milliseconds (cumulative count 28835780)
100.000% <= 2082.815 milliseconds (cumulative count 28835790)
100.000% <= 2396.159 milliseconds (cumulative count 28835812)
100.000% <= 2398.207 milliseconds (cumulative count 28835821)
100.000% <= 2402.303 milliseconds (cumulative count 28835829)
100.000% <= 2404.351 milliseconds (cumulative count 28835840)
100.000% <= 2404.351 milliseconds (cumulative count 28835840)

Summary:
  throughput summary: 32130.79 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.446     0.336     1.255     2.143     2.479  2404.351